In [1]:
import pandas as pd
import numpy as np

In [31]:
data =  {'eng':[10,30,50,70],
         'kor':[20,40,60,80],
         'math':[90,50,20,70]}
df = pd.DataFrame(data,index=['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [ ]:
#산술,관계,논리

In [6]:
df+2

   eng  kor  math
a   12   22    92
b   32   42    52
c   52   62    22
d   72   82    72

In [7]:
df*2

   eng  kor  math
a   20   40   180
b   60   80   100
c  100  120    40
d  140  160   140

In [9]:
df['eng'] = 2

In [11]:
df['eng'] = [1,2,3,4]

In [15]:
df['eng'] = df['eng']+2

In [20]:
df.loc['b'] =2

In [22]:
df.loc['b'] =[1,2,3]

In [24]:
df.loc['b'] = df.loc['b']+2

In [27]:
df.loc['c':,'kor':] = [[1,2],[3,4]]

In [29]:
df.loc['c':,'kor':] =df.loc['c':,'kor':]+2

In [33]:
#행단위 boolean indexing
df[ [True,False,True,True] ]

   eng  kor  math
a   10   20    90
c   50   60    20
d   70   80    70

In [36]:
df[ df['eng']>30 ] #df[ [False,False,True,True] ]

   eng  kor  math
c   50   60    20
d   70   80    70

In [38]:
sr = df['kor']
(sr==40) |(sr==80)

a    False
b     True
c    False
d     True
Name: kor, dtype: bool

In [39]:
df[ (df['kor']==40) | (df['kor']==80) ]

   eng  kor  math
b   30   40    50
d   70   80    70

In [40]:
# df[ df['eng']>30 ]
df.query( 'eng>30' )

   eng  kor  math
c   50   60    20
d   70   80    70

In [41]:
# df[ (df['kor']==40) | (df['kor']==80) ]
df.query( 'kor==40 or kor==80' )

   eng  kor  math
b   30   40    50
d   70   80    70

In [43]:
df[ (df['kor']>=20) & (df['kor']<=50) ]

   eng  kor  math
a   10   20    90
b   30   40    50

In [44]:
# df.query( '20<=kor<=50' )
df.query( '20<=kor and kor<=50' )

   eng  kor  math
a   10   20    90
b   30   40    50

In [47]:
n = 30
df.query( f'eng>{n}' ) #'eng>30'

   eng  kor  math
c   50   60    20
d   70   80    70

In [46]:
n = 30
s = f'n={n}'
s

'n=30'

In [32]:
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70